
means to improve validation results

Dropout

	



Model: "functional_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         [(None, 200, 200, 1)]     0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 200, 200, 8)       80        
_________________________________________________________________
batch_normalization_20 (Batc (None, 200, 200, 8)       32        
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 100, 100, 8)       0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 100, 100, 16)      3216      
_________________________________________________________________
batch_normalization_21 (Batc (None, 100, 100, 16)      64        
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 50, 50, 16)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 50, 50, 32)        12832  
_________________________________________________________________
batch_normalization_22 (Batc (None, 50, 50, 32)        128       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 25, 25, 64)        51264     
_________________________________________________________________
batch_normalization_23 (Batc (None, 25, 25, 64)        256       
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 7, 7, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 3137      
=================================================================
Total params: 71,009
Trainable params: 70,769
Non-trainable params: 240
_________________________________________________________________